{
  "company_name": "LIG Nex1",
  "resume_summary": "최준범 지원자님은 인하대학교 항공우주공학과를 졸업하고, 무인체계 및 로봇 제어 분야에서 다수의 프로젝트 경험과 연구 인턴십을 통해 기술 전문성을 쌓았습니다. 특히 UWB 센서 기반 위치 추정, LiDAR SLAM 최적화, 다중 로봇 군집 제어, 자율주행 제어 알고리즘 개발 역량을 보유하고 있으며, LIG Nex1의 Military Robotics 전문가로 성장하겠다는 강한 의지를 가지고 있습니다.",
  "total_questions": 12,
  "questions": [
    {
      "후속 질문 템플릿": [
        "자기소개에서 언급한 [특정 키워드]에 대해 좀 더 자세히 설명해주실 수 있나요?",
        "LIG Nex1의 [특정 사업 분야]에 특히 관심이 있으신가요?"
      ],
      "질문 내용": "1분 내외로 자기소개를 부탁드리며, LIG Nex1의 무인체계/로봇 분야에 지원하게 된 동기를 말씀해 주십시오.",
      "좋은 답변의 기준": "간결하고 명확한 자기소개, LIG Nex1의 사업 분야와 비전을 언급하며 지원 동기 설명, 본인의 강점과 회사의 비전을 연결하여 설득력 있게 제시.",
      "예상 답변 키포인트": "지원 직무와 관련된 핵심 역량 요약, LIG Nex1에 대한 관심과 기여 의지, 무인체계/로봇 분야 전문성 어필.",
      "질문 의도": "지원자의 기본적인 의사소통 능력, 자신감, 직무 및 회사에 대한 이해도를 파악하고, 직무에 대한 열정과 가치관을 확인합니다.",
      "평가하려는 역량": "의사소통 능력, 직무 이해도, 회사 및 직무 열정",
      "기업 인재상과의 연관성": "'도전과 혁신을 추구하는 인재', '미래 (Future-oriented)' - 회사의 비전에 대한 이해와 본인의 성장 비전의 연관성"
    },
    {
      "평가하려는 역량": "현실성, 직무 열정, 의사소통 능력",
      "예상 답변 키포인트": "회사 및 직무에 대한 강한 입사 의지, 연봉보다는 성장 기회나 직무 경험을 우선시하는 태도, 회사 내규에 따르겠다는 유연한 입장.",
      "후속 질문 템플릿": [],
      "질문 내용": "이력서에 희망연봉을 '0만원'으로 기재하셨는데, 이에 대한 솔직한 의견이나 구체적인 입장을 듣고 싶습니다.",
      "질문 의도": "지원자의 연봉에 대한 현실적인 기대치, 회사에 대한 기여 의지, 그리고 직무에 대한 순수한 열정을 확인합니다. 또한, 향후 협상 과정에서의 유연성을 파악합니다.",
      "좋은 답변의 기준": "연봉보다는 직무를 통해 성장하고 기여하려는 의지를 명확히 밝히며, 회사의 보상 체계에 대한 존중을 표현.",
      "기업 인재상과의 연관성": "'책임감과 윤리의식을 갖춘 인재' - 회사에 대한 진정성 있는 태도"
    },
    {
      "후속 질문 템플릿": [
        "UWB 센서의 다른 한계점은 무엇이며, 이를 극복하기 위해 어떤 추가적인 연구를 해볼 수 있을까요?",
        "이 경험이 LIG Nex1의 [특정 무인체계] 개발에 어떻게 기여할 수 있다고 생각하시나요?"
      ],
      "질문 내용": "\"데이터에 숨은 퍼즐을 풀다\" 프로젝트에서 UWB 센서의 편향(bias)을 분석하고 AI 기반 모델로 보정한 경험에 대해 자세히 설명해 주십시오. 특히, 어떤 기술적 난관이 있었고 어떻게 해결했는지 궁금합니다.",
      "질문 의도": "지원자의 문제 해결 능력, 분석적 사고, 전문 기술 역량(UWB 센서, AI 모델) 및 학술적 성과 도출 능력을 평가합니다.",
      "좋은 답변의 기준": "문제 정의, 본인의 역할, 해결 과정(구체적인 기술적 접근), 결과 및 기여도를 STAR 기법으로 명확히 설명하고, LIG Nex1의 무인체계에 어떻게 적용할 수 있을지 연결.",
      "평가하려는 역량": "문제 해결 능력, 분석적 사고, 기술 전문성(UWB, AI), 혁신성, 학술적 성과",
      "예상 답변 키포인트": "UWB 센서 편향의 구체적인 원인, 데이터셋 구축 과정, AI 모델 설계 및 적용, 성능 개선 효과(정확도, 안정성), 연구 과정에서의 어려움과 해결 과정.",
      "기업 인재상과의 연관성": "'도전과 혁신을 추구하는 인재', '최고의 기술 전문성을 가진 인재'"
    },
    {
      "예상 답변 키포인트": "시스템 아키텍처, 통신 방식(ROS), 제어 로직, 군집 제어 시 동기화/충돌 방지 등의 문제, 쉘 스크립트 활용 및 UWB 긴급 정지 로직 적용, 실험 결과 및 성능.",
      "질문 의도": "다중 로봇 시스템에 대한 이해, 시스템 통합 능력, ROS 활용 능력, 문제 해결 능력 및 협업 역량을 평가합니다.",
      "기업 인재상과의 연관성": "'최고의 기술 전문성을 가진 인재', '협력과 상생을 실천하는 인재'",
      "질문 내용": "KAIST 미래도시로봇연구실 인턴 당시, UAV 5대와 UGV 5대를 동시에 운용하는 군집 제어 솔루션을 구축하고 ROS 기반 중앙집중형 통신 및 제어기를 설계한 경험에 대해 구체적으로 설명해 주십시오. 특히, 다수의 로봇을 동시에 제어하면서 발생했던 이슈와 해결 방안은 무엇이었습니까?",
      "평가하려는 역량": "시스템 설계 및 통합, ROS 활용, 문제 해결 능력, 협업",
      "좋은 답변의 기준": "다중 로봇 시스템의 복잡성을 이해하고, 본인의 역할을 명확히 설명하며, 기술적인 문제 해결 과정을 상세히 제시. 협업을 통한 시너지 효과를 강조.",
      "후속 질문 템플릿": [
        "군집 제어 시스템에서 보안이나 안정성을 강화하기 위해 어떤 부분을 추가적으로 고려할 수 있을까요?"
      ]
    },
    {
      "후속 질문 템플릿": [
        "LiDAR SLAM의 한계점은 무엇이며, 이 한계점을 극복하기 위해 어떤 다른 센서 융합 방식을 고려할 수 있을까요?"
      ],
      "예상 답변 키포인트": "SLAM 알고리즘 선택 및 최적화, 경량화 방법(GPU/멀티쓰레딩), 위치 오차 보정 메커니즘, DDS 통신 활용 시각화 툴 개발, 극한 환경에서의 성능 유지 비결.",
      "좋은 답변의 기준": "SLAM 기술에 대한 깊이 있는 이해를 바탕으로, 복잡한 기술적 문제를 어떻게 단순화하고 최적화했는지 구체적인 사례를 들어 설명. 본인의 창의적인 기여를 강조.",
      "기업 인재상과의 연관성": "'최고의 기술 전문성을 가진 인재', '도전과 혁신을 추구하는 인재'",
      "질문 의도": "SLAM 기술 전문성, 임베디드 환경 최적화 능력, 극한 환경 대응 능력, 문제 해결 및 창의적 사고를 평가합니다.",
      "질문 내용": "K사 인턴십에서 고스트로보틱스 Vision60 플랫폼에 LiDAR 기반 SLAM 기술을 탑재하고, 특히 GPS 차단/험지 환경에서 5% 이내의 오차율을 유지하도록 오픈소스 SLAM 패키지를 경량화하고 위치 오차 보정 알고리즘을 적용한 경험에 대해 설명해 주십시오. 이 과정에서 가장 어려웠던 점과 이를 극복하기 위한 본인만의 아이디어나 노력은 무엇이었습니까?",
      "평가하려는 역량": "기술 전문성(LiDAR SLAM), 최적화 능력, 문제 해결, 창의성, 극한 환경 대응"
    },
    {
      "질문 내용": "\"팀을 내 일부로 만드는 법\"이라는 자율비행 드론 개발 프로젝트(팀 APD)에서 리더로서 팀원들의 동기 부여 및 협업을 이끌어냈던 경험에 대해 말씀해 주십시오. 특히, 팀원들의 몰입도가 낮았던 문제를 어떻게 인식하고 해결하여 팀의 성과를 이끌어냈는지 구체적으로 설명해 주십시오.",
      "예상 답변 키포인트": "문제 인식(본인의 일방적인 추진), 해결 노력(사과, 비전 공유 세미나, 역할 재조정), 팀원들의 자발적 참여 유도, 팀워크 증진 결과, 본인의 역할과 기여도.",
      "평가하려는 역량": "리더십, 협업, 문제 해결, 소통, 책임감",
      "기업 인재상과의 연관성": "'협력과 상생을 실천하는 인재', '책임감과 윤리의식을 갖춘 인재'",
      "후속 질문 템플릿": [
        "만약 팀원과의 갈등이 발생했을 때, 어떻게 해결해나갈지 본인의 철학을 말씀해주세요."
      ],
      "좋은 답변의 기준": "STAR 기법을 활용하여 상황, 과제, 행동, 결과를 명확히 설명. 특히, 자신의 한계를 인정하고 개선하려는 노력과 팀원들의 성장을 지원하는 리더십을 구체적인 사례로 제시.",
      "질문 의도": "리더십, 협업 능력, 문제 해결 능력, 갈등 관리 능력, 팀워크 증진 노력을 평가합니다."
    },
    {
      "후속 질문 템플릿": [],
      "기업 인재상과의 연관성": "'도전과 혁신을 추구하는 인재' (실패를 통한 성장), '전문성 (Professionalism)' (개선 노력)",
      "예상 답변 키포인트": "실패의 구체적인 내용, 실패 원인 분석, 극복하기 위한 노력, 얻은 교훈, 실제 다른 프로젝트에 적용한 사례.",
      "질문 내용": "프로젝트를 진행하면서 예상치 못한 실패나 어려움을 겪었던 경험이 있다면 설명해 주십시오. 그 실패를 통해 무엇을 배웠고, 다음 프로젝트에서 어떻게 적용했습니까?",
      "평가하려는 역량": "문제 해결, 학습 민첩성, 회복 탄력성, 책임감",
      "좋은 답변의 기준": "실패를 인정하고 그 원인을 객관적으로 분석하며, 이를 통해 배운 점을 명확히 제시. 다음 기회에 어떻게 개선했는지 구체적인 행동을 보여줌.",
      "질문 의도": "문제 해결 능력, 위기 관리 능력, 학습 태도, 회복 탄력성을 평가합니다."
    },
    {
      "좋은 답변의 기준": "ROS/ROS2의 핵심 개념을 정확히 이해하고 있으며, 복잡한 시스템을 설계하고 디버깅하는 실제 경험을 바탕으로 구체적인 기술적 문제 해결 사례를 제시.",
      "예상 답변 키포인트": "ROS/ROS2의 장단점, 메시지 통신(publish/subscribe, service, action), 노드 관리, 시뮬레이션(Gazebo), 디버깅 도구, 실제 프로젝트 적용 사례(예: 다중 로봇 통신, 센서 데이터 처리).",
      "질문 의도": "ROS/ROS2에 대한 실질적인 이해도와 활용 능력을 평가하고, 시스템 설계 역량을 확인합니다.",
      "후속 질문 템플릿": [
        "ROS2의 DDS 통신을 활용했던 경험이 있다면, ROS1과의 차이점과 ROS2의 장점을 살린 경험을 말씀해주세요."
      ],
      "기업 인재상과의 연관성": "'최고의 기술 전문성을 가진 인재'",
      "질문 내용": "이력서에 ROS/ROS2 활용 경험이 많다고 기재하셨습니다. ROS/ROS2 기반 시스템 설계 시 가장 중요하게 고려하는 요소는 무엇이며, 실제 프로젝트에서 ROS/ROS2의 어떤 기능들을 활용하여 어떤 문제를 해결했는지 구체적인 사례를 들어 설명해 주십시오.",
      "평가하려는 역량": "기술 전문성(ROS/ROS2), 시스템 설계, 문제 해결"
    },
    {
      "후속 질문 템플릿": [],
      "평가하려는 역량": "제어 이론 지식, 실제 적용 능력, 문제 분석, 개선 제안, 비판적 사고",
      "기업 인재상과의 연관성": "'최고의 기술 전문성을 가진 인재', '도전과 혁신을 추구하는 인재'",
      "질문 내용": "인하 자율셔틀 프로젝트에서 PD 제어와 Pure Pursuit 알고리즘을 활용하여 차량의 종/횡방향 속도 입력 값 계산 로직을 개발하셨습니다. 이러한 제어 알고리즘을 실제 무인체계에 적용할 때 어떤 점을 가장 중요하게 생각하며, 본인이 개발한 로직의 한계점과 개선 방안에 대해 설명해 주십시오.",
      "예상 답변 키포인트": "PD 제어 및 Pure Pursuit의 원리, 실제 차량 적용 시 고려사항(외란, 센서 노이즈), 개발 로직의 한계점(예: 저속/고속 성능, 급커브 대응), 개선 방안(모델 예측 제어, 강화 학습 등).",
      "좋은 답변의 기준": "이론적 지식과 실제 적용 경험을 균형 있게 제시하고, 본인 개발 로직의 장단점을 객관적으로 분석하며 구체적인 개선 아이디어를 제시.",
      "질문 의도": "제어 이론에 대한 이해, 실제 적용 능력, 문제점 분석 및 개선 능력, 비판적 사고를 평가합니다."
    },
    {
      "질문 내용": "LIG Nex1에서 \"Military Robotics 전문가\"로 성장하고 싶다는 비전을 제시하셨습니다. 구체적으로 어떤 분야의 Military Robotics 전문가가 되고 싶으며, LIG Nex1의 어떤 기술 또는 프로젝트에 기여하고 싶은지 말씀해 주십시오.",
      "좋은 답변의 기준": "LIG Nex1의 사업 분야와 비전을 명확히 이해하고 있음을 보여주며, 본인의 기술 역량과 성장 목표를 회사의 장기적인 목표와 연결하여 구체적이고 현실적인 비전을 제시.",
      "후속 질문 템플릿": [
        "LIG Nex1이 Military Robotics 분야에서 더욱 성장하기 위해 어떤 노력이 필요하다고 보시나요?"
      ],
      "기업 인재상과의 연관성": "'미래 (Future-oriented)', '도전과 혁신을 추구하는 인재', '최고의 기술 전문성을 가진 인재'",
      "질문 의도": "지원자의 회사 및 직무에 대한 이해도, 장기적인 비전, 그리고 회사 비전과의 정합성을 평가합니다.",
      "예상 답변 키포인트": "LIG Nex1의 무인체계 사업 분야(정밀 유도무기, 감시 정찰 등) 언급, 본인의 강점(다중 로봇 군집 제어, 위치 추정, SLAM)을 활용한 기여 방안, 구체적인 성장 로드맵 제시.",
      "평가하려는 역량": "회사 이해도, 직무 이해도, 비전 제시, 성장 가능성"
    },
    {
      "평가하려는 역량": "자기 이해, 회사 이해도, 가치관 정렬, 소통",
      "기업 인재상과의 연관성": "(모든 인재상 직접 연관)",
      "예상 답변 키포인트": "본인이 선택한 인재상(예: 도전과 혁신, 최고의 기술 전문성)을 명확히 제시, 관련된 구체적인 프로젝트 경험(UWB 편향 분석, 팀 APD 등)을 들어 설명, 해당 인재상이 LIG Nex1에서 어떻게 발휘될지 제시.",
      "후속 질문 템플릿": [],
      "좋은 답변의 기준": "단순히 인재상을 나열하는 것이 아니라, 본인의 핵심 경험(STAR 기법)과 연결하여 해당 인재상이 자신에게 어떻게 내재화되어 있는지를 설득력 있게 설명.",
      "질문 내용": "LIG Nex1은 '도전과 혁신', '최고의 기술 전문성', '협력과 상생', '책임감과 윤리의식', '글로벌 역량'을 갖춘 인재를 추구합니다. 이 중에서 본인이 가장 강점이라고 생각하는 인재상은 무엇이며, 그 이유를 구체적인 경험을 바탕으로 설명해 주십시오.",
      "질문 의도": "지원자가 회사의 인재상에 얼마나 부합하는지, 그리고 본인의 강점을 인재상과 연결하여 설명할 수 있는지를 평가합니다."
    },
    {
      "질문 내용": "방산 기업으로서 LIG Nex1은 높은 윤리 의식과 책임감을 요구합니다. 본인의 경험 중에서 윤리적인 딜레마에 직면했거나, 안전 또는 보안과 관련된 중요한 결정을 내렸던 경험이 있다면 이야기해 주십시오. 또한, 그러한 상황에서 어떻게 '도전'의 가치를 발휘했는지도 함께 설명해 주십시오.",
      "예상 답변 키포인트": "구체적인 상황 묘사, 딜레마 인지, 윤리적 기준 또는 원칙, 결정 과정, 결과 및 교훈, 어려움을 극복하려는 도전적 태도.",
      "질문 의도": "지원자의 윤리 의식, 책임감, 보안 의식, 그리고 어려운 상황에서의 도전 정신과 문제 해결 능력을 평가합니다.",
      "평가하려는 역량": "윤리 의식, 책임감, 보안 의식, 문제 해결, 도전 정신",
      "좋은 답변의 기준": "윤리적 문제에 대한 깊이 있는 고민과 책임감 있는 행동을 구체적으로 제시하고, 단순히 회피하기보다 문제 해결을 위해 능동적으로 노력했던 '도전'의 사례를 연결하여 설명.",
      "기업 인재상과의 연관성": "'책임감과 윤리의식을 갖춘 인재', '도전과 혁신을 추구하는 인재', '정도 (Integrity)'",
      "후속 질문 템플릿": []
    }
  ],
  "questions_text": "1. 1분 내외로 자기소개를 부탁드리며, LIG Nex1의 무인체계/로봇 분야에 지원하게 된 동기를 말씀해 주십시오.\n2. 이력서에 희망연봉을 '0만원'으로 기재하셨는데, 이에 대한 솔직한 의견이나 구체적인 입장을 듣고 싶습니다.\n3. \"데이터에 숨은 퍼즐을 풀다\" 프로젝트에서 UWB 센서의 편향(bias)을 분석하고 AI 기반 모델로 보정한 경험에 대해 자세히 설명해 주십시오. 특히, 어떤 기술적 난관이 있었고 어떻게 해결했는지 궁금합니다.\n4. KAIST 미래도시로봇연구실 인턴 당시, UAV 5대와 UGV 5대를 동시에 운용하는 군집 제어 솔루션을 구축하고 ROS 기반 중앙집중형 통신 및 제어기를 설계한 경험에 대해 구체적으로 설명해 주십시오. 특히, 다수의 로봇을 동시에 제어하면서 발생했던 이슈와 해결 방안은 무엇이었습니까?\n5. K사 인턴십에서 고스트로보틱스 Vision60 플랫폼에 LiDAR 기반 SLAM 기술을 탑재하고, 특히 GPS 차단/험지 환경에서 5% 이내의 오차율을 유지하도록 오픈소스 SLAM 패키지를 경량화하고 위치 오차 보정 알고리즘을 적용한 경험에 대해 설명해 주십시오. 이 과정에서 가장 어려웠던 점과 이를 극복하기 위한 본인만의 아이디어나 노력은 무엇이었습니까?\n6. \"팀을 내 일부로 만드는 법\"이라는 자율비행 드론 개발 프로젝트(팀 APD)에서 리더로서 팀원들의 동기 부여 및 협업을 이끌어냈던 경험에 대해 말씀해 주십시오. 특히, 팀원들의 몰입도가 낮았던 문제를 어떻게 인식하고 해결하여 팀의 성과를 이끌어냈는지 구체적으로 설명해 주십시오.\n7. 프로젝트를 진행하면서 예상치 못한 실패나 어려움을 겪었던 경험이 있다면 설명해 주십시오. 그 실패를 통해 무엇을 배웠고, 다음 프로젝트에서 어떻게 적용했습니까?\n8. 이력서에 ROS/ROS2 활용 경험이 많다고 기재하셨습니다. ROS/ROS2 기반 시스템 설계 시 가장 중요하게 고려하는 요소는 무엇이며, 실제 프로젝트에서 ROS/ROS2의 어떤 기능들을 활용하여 어떤 문제를 해결했는지 구체적인 사례를 들어 설명해 주십시오.\n9. 인하 자율셔틀 프로젝트에서 PD 제어와 Pure Pursuit 알고리즘을 활용하여 차량의 종/횡방향 속도 입력 값 계산 로직을 개발하셨습니다. 이러한 제어 알고리즘을 실제 무인체계에 적용할 때 어떤 점을 가장 중요하게 생각하며, 본인이 개발한 로직의 한계점과 개선 방안에 대해 설명해 주십시오.\n10. LIG Nex1에서 \"Military Robotics 전문가\"로 성장하고 싶다는 비전을 제시하셨습니다. 구체적으로 어떤 분야의 Military Robotics 전문가가 되고 싶으며, LIG Nex1의 어떤 기술 또는 프로젝트에 기여하고 싶은지 말씀해 주십시오.\n11. LIG Nex1은 '도전과 혁신', '최고의 기술 전문성', '협력과 상생', '책임감과 윤리의식', '글로벌 역량'을 갖춘 인재를 추구합니다. 이 중에서 본인이 가장 강점이라고 생각하는 인재상은 무엇이며, 그 이유를 구체적인 경험을 바탕으로 설명해 주십시오.\n12. 방산 기업으로서 LIG Nex1은 높은 윤리 의식과 책임감을 요구합니다. 본인의 경험 중에서 윤리적인 딜레마에 직면했거나, 안전 또는 보안과 관련된 중요한 결정을 내렸던 경험이 있다면 이야기해 주십시오. 또한, 그러한 상황에서 어떻게 '도전'의 가치를 발휘했는지도 함께 설명해 주십시오.",
  "timestamp": "2025-10-27T21:25:40.399487",
  "created_by": "interview_agent_adk"
}